Revit 2025 API
FabricTagComponentReference Enumeration
 How FabricSheet tag text will be aligned to the FabricSheet symbol.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum FabricTagComponentReference
Public Enumeration FabricTagComponentReference
public enum class FabricTagComponentReference
type FabricTagComponentReference
Members
Member name | Value | Description
MajorAxis | 0 |  Tag and Leader will reference the symbol major direction axis.
MinorAxis | 1 |  Tag and Leader will reference the symbol minor direction axis.
Diagonal | 2 |  Tag and Leader will reference the symbol diagonal.
Intersection | 3 |  Tag and Leader will reference the intersection of the major and minor axes.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace